{
  "Calculate": "Calculer",
  "cm": "cm",
  "height": "Hauteur",
  "weight": "Poids",
  "calculate": "Calculer",
  "title": "Vie Heureuse Pour Toujours",
  "appTitle": "Calculateur de BMI",
  "records": "Enregistrements",
  "rateUs": "Évaluez-nous",
  "version": "Vie Heureuse",
  "privacyPolicyContent": "Politique de confidentialité : BMI Calculator Pro ne nécessite pas d'enregistrement utilisateur et ne partage pas de données personnelles avec qui que ce soit.\n\n Nous utilisons Google Analytics et des rapports de plantage pour améliorer l'application. \n\n En utilisant cette application, vous acceptez notre politique de confidentialité.",
  "record": "Enregistrement",
  "noRecordFound": "Aucun enregistrement trouvé",
  "kg": "kg",
  "youNeedTo": "Vous devez {action}",
  "gain": "gagner",
  "lose": "perdre",
  "yourIdealWeight": "Votre poids idéal",
  "seriouslyObese": "Gravement obèse",
  "above40": "au-dessus de 40",
  "leftText1": "Vous devez",
  "leftText2": "Votre poids idéal",
  "rightText1": "perdre 5 kg",
  "rightText2": "60-70 kg",
  "app_name": "Calculateur de BMI",
  "normal_weight_description": "Vous êtes à un poids sain ; concentrez-vous sur le maintien en suivant un mode de vie équilibré. Consultez un médecin ou un nutritionniste qualifié avant de faire des changements significatifs dans votre alimentation ou votre mode de vie.",
  "normal_weight_diet": "Il est conseillé de manger une alimentation équilibrée qui comprend beaucoup de fruits, de légumes et de protéines maigres.",
  "normal_weight_exercise": "Mélangez des exercices de cardio et de musculation pour maintenir votre niveau de forme actuel.",
  "normal_weight_lifestyle": "Établissez des objectifs de santé réalistes pour rester motivé.",
  "obese_description": "Votre poids devient un risque pour la santé ; prenez les mesures nécessaires pour y remédier, mais consultez un médecin qualifié avant de faire des changements.",
  "obese_diet": "Vous êtes encouragé à suivre un plan alimentaire bien structuré. Votre plan alimentaire devrait se concentrer sur des aliments riches en fibres et faibles en calories.",
  "obese_exercise": "Nous vous recommandons de commencer par des exercices à faible impact comme la marche ou la natation pour réduire la pression sur les articulations.",
  "obese_lifestyle": "Il est fortement recommandé de consulter un spécialiste de la santé.",
  "overweight_description": "Vous prenez du poids supplémentaire. Suivez les étapes nécessaires :",
  "overweight_diet": "Il est conseillé de manger une alimentation équilibrée riche en fruits et légumes.",
  "overweight_exercise": "Vous devez faire un peu d'exercice supplémentaire pour perdre du poids.",
  "overweight_lifestyle": "Il vous est suggéré de surveiller régulièrement votre pression artérielle, votre taux de cholestérol et votre glycémie.",
  "seriously_obese_description": "Votre poids est à un stade risqué. Veuillez suivre les étapes nécessaires :",
  "seriously_obese_diet": "Vous êtes fortement conseillé de suivre un plan alimentaire fourni par un professionnel.",
  "seriously_obese_exercise": "Prenez un plan d'exercice approprié auprès d'un professionnel.",
  "seriously_obese_lifestyle": "Conseils pour vivre sous la surveillance d'un médecin professionnel.",
  "underweight_diet": "Mangez régulièrement des aliments riches en nutriments et demandez des repas pour prendre du poids.",
  "underweight_exercise": "Faites de la musculation pour développer vos muscles. Essayez d'éviter les exercices de cardio.",
  "underweight_lifestyle": "Il vous est recommandé de consulter un spécialiste de la santé pour prendre du poids de manière appropriée.",
  "perfect_weight": "Vous êtes à un poids sain ; maintenez-le en suivant un mode de vie équilibré et assurez-vous de consulter un médecin qualifié avant de faire des changements.",
  "mix_exercise": "Il vous est suggéré de mélanger des exercices de cardio et de musculation pour maintenir votre condition physique actuelle.",
  "fit_in_weight": "Adoptez une alimentation équilibrée, restez actif, donnez la priorité au sommeil, gérez le stress, évitez de fumer et l'alcool excessif, et maintenez des contrôles de santé réguliers pour soutenir un mode de vie sain.",
  "go_home": "Aller à la maison",
  "exercise_recommendation": "Nous vous recommandons de mélanger des exercices de cardio et de musculation.",
  "health_tips": "Maintenez un mode de vie sain.",
  "app_title": "Le Titre de Votre Application",
  "normal_weight": "Poids Normal",
  "no_record_found": "Aucun enregistrement trouvé",
  "recalculate": "Recalculer",
  "underweight": "Sous-poids",
  "normal": "Normal",
  "overweight": "Surpoids",
  "obese": "Obèse",
  "seriously_obese": "Gravement Obèse",
  "privacy_policy": "Politique de confidentialité",
  "rate_us": "Évaluez-nous",
  "privacy_policy_text": "Politique de confidentialité : BMI Calculator Pro ne nécessite pas d'enregistrement utilisateur et ne partage pas de données personnelles avec qui que ce soit.\n\n Nous utilisons Google Analytics et des rapports de plantage pour améliorer l'application. \n\n En utilisant cette application, vous acceptez notre politique de confidentialité.",
  "result": "Résultat",
  "bmi": "IMC",
  "you_need_to": "Vous devez {action}",
  "your_ideal_weight": "Votre poids idéal",
  "tips": "Conseils",
  "save": "Sauvegarder",
  "re_calculate": "Recalculer",
  "above_40": "au-dessus de 40",
  "ad_loaded": "{0} chargé.",
  "ad_failed_to_load": "L'annonce BannerAd a échoué à se charger : {0}",
  "fieldName": "Nom du champ",
  "fieldType": "Type",
  "fieldFirstParameter": "Premier paramètre",
  "fieldSecondParameter": "Deuxième paramètre",
  "left_label": "Votre IMC",
  "right_label": "25.0",
  "Tips": "Conseils",
  "All tips": "Tous les conseils",
  "Underweight": "Sous-poids",
  "Normal": "Normal",
  "Overweight": "Surpoids",
  "Obese": "Obèse",
  "Seriously Obese": "Gravement Obèse",
  "You have a perfect weight. Just maintain this weight and follow some lifestyles.": "Vous êtes à un poids parfait. Maintenez ce poids et suivez un mode de vie sain.",
  "Encouraged to eat a balanced diet rich in fruits, vegetables, lean protein and so on.": "Il est conseillé de manger une alimentation équilibrée riche en fruits, légumes, protéines maigres, etc.",
  "You are suggested to mix cardio and strength training exercise to maintain your current fitness.": "Il vous est suggéré de mélanger des exercices de cardio et de musculation pour maintenir votre forme physique actuelle.",
  "You are fit in weight. Just maintain this.": "Vous êtes à un poids sain. Maintenez-le.",
  "Your overweight is becoming risky. Follow the necessary steps:": "Votre surpoids devient risqué. Suivez les étapes nécessaires :",
  "You are encouraged to take a well-planned diet food chart. Your food chart should focus on high-fiber, low-calorie foods.": "Vous êtes encouragé à suivre un plan alimentaire bien structuré. Votre plan alimentaire doit se concentrer sur des aliments riches en fibres et faibles en calories.",
  "We recommend you start with low-impact exercises like walking or swimming to reduce strain on joints.": "Nous vous recommandons de commencer par des exercices à faible impact comme la marche ou la natation pour réduire la pression sur les articulations.",
  "You are strongly recommended to consult a healthcare specialist.": "Il est fortement recommandé de consulter un spécialiste de la santé.",
  "You are gaining extra weight. Follow the necessary steps:": "Vous prenez du poids supplémentaire. Suivez les étapes nécessaires :",
  "Encouraged to eat a balanced diet rich in fruits and vegetables.": "Il est conseillé de manger une alimentation équilibrée riche en fruits et légumes.",
  "You need to take some extra exercise to lose some weight.": "Vous devez faire un peu d'exercice supplémentaire pour perdre du poids.",
  "You are suggested for regular monitoring of blood pressure, cholesterol levels, and blood sugar.": "Il vous est suggéré de surveiller régulièrement votre pression artérielle, vos niveaux de cholestérol et votre glycémie.",
  "Your weight is in the risky stage. Please follow the necessary steps:": "Votre poids est à un stade risqué. Veuillez suivre les étapes nécessaires :",
  "You are strongly advised to take a diet chart from a professional.": "Il vous est fortement conseillé de prendre un plan alimentaire d'un professionnel.",
  "Take a proper exercise chart from a professional.": "Prenez un plan d'exercice approprié d'un professionnel.",
  "Advice to the user to live under the surveillance of a professional doctor.": "Conseils à l'utilisateur de vivre sous la surveillance d'un médecin professionnel.",
  "You need to gain some weight. You can follow these steps:": "Vous devez prendre du poids. Vous pouvez suivre ces étapes :",
  "Do some strength training to build muscles. Try to avoid cardio exercises.": "Faites de la musculation pour développer vos muscles. Essayez d'éviter les exercices de cardio.",
  "You are recommended to take counseling from a health specialist to gain proper weight.": "Il est conseillé de consulter un spécialiste de la santé pour prendre du poids de manière appropriée.",
  "Diet:": "Régime :",
  "Exercise:": "Exercice :",
  "Lifestyle Tips:": "Conseils de mode de vie :",
  "Go to home": "Aller à la maison",
  "male": "Masculin",
  "female": "Féminin",
  "Privacy Policy": "Politique de confidentialité : BMI Calculator Pro ne nécessite pas d'enregistrement utilisateur et ne partage pas de données personnelles avec qui que ce soit.\n\n Nous utilisons Google Analytics et des rapports de plantage pour améliorer l'application. \n\n En utilisant cette application, vous acceptez notre politique de confidentialité.",
  "underweight_description": "Pour prendre du poids de manière saine, faites-le de manière sûre et durable. Suivez ces lignes directrices, mais consultez un médecin ou un nutritionniste qualifié avant d'apporter des changements majeurs à votre alimentation ou à votre mode de vie.",
  "Eat high-nutrient foods regularly and take requests for meals to gain some weight.": "Mangez régulièrement des aliments riches en nutriments et demandez des repas pour prendre du poids."
}
